
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СхемаПриИзменении(Элемент)
	
	ЭлементыСхемы.Очистить();
	
	МассивЭлементов = ГС_СхемаКлиентСервер.ПолучитьЭлементыСхемы(Схема);
	Для каждого ЭлементСхемы Из МассивЭлементов Цикл
		НоваяСтрока = ЭлементыСхемы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементСхемы);
		
		Если ЭлементСхемы.Тип = ГС_СхемаКлиентСервер.ТипыБлоков().ВыборВарианта Тогда
			Для каждого Вариант Из ЭлементСхемы.МассивВариантов Цикл
				НовыйВариант = НоваяСтрока.Варианты.Добавить();
				ЗаполнитьЗначенияСвойств(НовыйВариант, Вариант);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьСтарт(Команда)
	
	ТипыБлоков = ГС_СхемаКлиентСервер.ТипыБлоков();
	
	СледующийНомерБлока = ПолучитьСледующийНомерБлока(ТипыБлоков.Старт);
	
	Блок = ЭлементыСхемы.Добавить();
	Блок.Тип           = ТипыБлоков.Старт;
	Блок.НомерПП       = МаксимальныйНомерЭлемента + 1;
	Блок.Идентификатор = "Старт" + СледующийНомерБлока;
	Блок.КоординатаX   = 60;
	Блок.КоординатаY   = 40;
	Блок.РазмерX       = 80;
	Блок.РазмерY       = 60;
	Блок.Заголовок     = "Старт" + СледующийНомерБлока;
	
	СледующийНомерЛинии = ПолучитьСледующийНомерБлока(ТипыБлоков.Линия);
	
	КоординатыТочек = Новый СписокЗначений;
	КоординатыТочек.Добавить(100);
	КоординатыТочек.Добавить(100);
	КоординатыТочек.Добавить(100);
	КоординатыТочек.Добавить(130);
	
	Линия = ЭлементыСхемы.Добавить();
	Линия.Тип                 = ТипыБлоков.Линия;
	Линия.НомерПП             = МаксимальныйНомерЭлемента + 2;
	Линия.Идентификатор       = "Линия" + СледующийНомерЛинии;
	Линия.ВладелецЛинии       = Блок.НомерПП;
	Линия.ТочкаВладельцаЛинии = 4;
	Линия.ЦельЛинии           = -1;
	Линия.ТочкаЦелиЛинии      = 2;
	Линия.КоординатыТочек     = КоординатыТочек;
	
	ГС_СхемаКлиентСервер.УстановитьСхемуИзЭлементов(Схема, СформироватьМассивЭлементов());
	
	УстановитьНомерБлока(ТипыБлоков.Старт, СледующийНомерБлока);
	УстановитьНомерБлока(ТипыБлоков.Линия, СледующийНомерЛинии);
	МаксимальныйНомерЭлемента = МаксимальныйНомерЭлемента + 2;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьДействие(Команда)

	ТипыБлоков = ГС_СхемаКлиентСервер.ТипыБлоков();
	
	СледующийНомерБлока = ПолучитьСледующийНомерБлока(ТипыБлоков.Действие);
	
	Блок = ЭлементыСхемы.Добавить();
	Блок.Тип           = ТипыБлоков.Действие;
	Блок.НомерПП       = МаксимальныйНомерЭлемента + 1;
	Блок.Идентификатор = "Дейстие" + СледующийНомерБлока;
	Блок.КоординатаX   = 60;
	Блок.КоординатаY   = 40;
	Блок.РазмерX       = 160;
	Блок.РазмерY       = 80;
	Блок.Заголовок     = "Дейстие" + СледующийНомерБлока;
	
	СледующийНомерЛинии = ПолучитьСледующийНомерБлока(ТипыБлоков.Линия);
	
	КоординатыТочек = Новый СписокЗначений;
	КоординатыТочек.Добавить(140);
	КоординатыТочек.Добавить(120);
	КоординатыТочек.Добавить(140);
	КоординатыТочек.Добавить(150);
	
	Линия = ЭлементыСхемы.Добавить();
	Линия.Тип                 = ТипыБлоков.Линия;
	Линия.НомерПП             = МаксимальныйНомерЭлемента + 2;
	Линия.Идентификатор       = "Линия" + СледующийНомерЛинии;
	Линия.ВладелецЛинии       = Блок.НомерПП;
	Линия.ТочкаВладельцаЛинии = 4;
	Линия.ЦельЛинии           = -1;
	Линия.ТочкаЦелиЛинии      = 2;
	Линия.КоординатыТочек     = КоординатыТочек;

	ГС_СхемаКлиентСервер.УстановитьСхемуИзЭлементов(Схема, СформироватьМассивЭлементов());
	
	УстановитьНомерБлока(ТипыБлоков.Действие, СледующийНомерБлока);
	УстановитьНомерБлока(ТипыБлоков.Линия, СледующийНомерЛинии);
	МаксимальныйНомерЭлемента = МаксимальныйНомерЭлемента + 2;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьУсловие(Команда)

	ТипыБлоков = ГС_СхемаКлиентСервер.ТипыБлоков();
	
	СледующийНомерБлока = ПолучитьСледующийНомерБлока(ТипыБлоков.Условие);
	
	Блок = ЭлементыСхемы.Добавить();
	Блок.Тип           = ТипыБлоков.Условие;
	Блок.НомерПП       = МаксимальныйНомерЭлемента + 1;
	Блок.Идентификатор = "Условие" + СледующийНомерБлока;
	Блок.КоординатаX   = 60;
	Блок.КоординатаY   = 40;
	Блок.РазмерX       = 160;
	Блок.РазмерY       = 80;
	Блок.Заголовок     = "Условие" + СледующийНомерБлока;
	
	СледующийНомерЛинии = ПолучитьСледующийНомерБлока(ТипыБлоков.Линия);
	
	КоординатыТочек = Новый СписокЗначений;
	КоординатыТочек.Добавить(60);
	КоординатыТочек.Добавить(80);
	КоординатыТочек.Добавить(30);
	КоординатыТочек.Добавить(80);
	
	Линия = ЭлементыСхемы.Добавить();
	Линия.Тип                 = ТипыБлоков.Линия;
	Линия.НомерПП             = МаксимальныйНомерЭлемента + 2;
	Линия.Идентификатор       = "Линия" + СледующийНомерЛинии;
	Линия.ВладелецЛинии       = Блок.НомерПП;
	Линия.ТочкаВладельцаЛинии = 1;
	Линия.ЦельЛинии           = -1;
	Линия.ТочкаЦелиЛинии      = 2;
	Линия.КоординатыТочек     = КоординатыТочек;
	Линия.Заголовок           = "Да";

	КоординатыТочек = Новый СписокЗначений;
	КоординатыТочек.Добавить(220);
	КоординатыТочек.Добавить(80);
	КоординатыТочек.Добавить(250);
	КоординатыТочек.Добавить(80);
	
	Линия = ЭлементыСхемы.Добавить();
	Линия.Тип                 = ТипыБлоков.Линия;
	Линия.НомерПП             = МаксимальныйНомерЭлемента + 3;
	Линия.Идентификатор       = "Линия" + (СледующийНомерЛинии + 1);
	Линия.ВладелецЛинии       = Блок.НомерПП;
	Линия.ТочкаВладельцаЛинии = 3;
	Линия.ЦельЛинии           = -1;
	Линия.ТочкаЦелиЛинии      = 2;
	Линия.КоординатыТочек     = КоординатыТочек;
	Линия.Заголовок           = "Нет";
	
	ГС_СхемаКлиентСервер.УстановитьСхемуИзЭлементов(Схема, СформироватьМассивЭлементов());
	
	УстановитьНомерБлока(ТипыБлоков.Условие, СледующийНомерБлока);
	УстановитьНомерБлока(ТипыБлоков.Линия, СледующийНомерЛинии + 1);
	МаксимальныйНомерЭлемента = МаксимальныйНомерЭлемента + 3;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗавершение(Команда)
	
	ТипыБлоков = ГС_СхемаКлиентСервер.ТипыБлоков();
	
	СледующийНомерБлока = ПолучитьСледующийНомерБлока(ТипыБлоков.Завершение);
	
	Блок = ЭлементыСхемы.Добавить();
	Блок.Тип           = ТипыБлоков.Завершение;
	Блок.НомерПП       = МаксимальныйНомерЭлемента + 1;
	Блок.Идентификатор = "Завершение" + СледующийНомерБлока;
	Блок.КоординатаX   = 60;
	Блок.КоординатаY   = 40;
	Блок.РазмерX       = 80;
	Блок.РазмерY       = 60;
	Блок.Заголовок     = "Завершение" + СледующийНомерБлока;
	
	ГС_СхемаКлиентСервер.УстановитьСхемуИзЭлементов(Схема, СформироватьМассивЭлементов());
	
	УстановитьНомерБлока(ТипыБлоков.Завершение, СледующийНомерБлока);
	МаксимальныйНомерЭлемента = МаксимальныйНомерЭлемента + 2;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВыборВарианта(Команда)

	ТипыБлоков = ГС_СхемаКлиентСервер.ТипыБлоков();
	
	СледующийНомерБлока = ПолучитьСледующийНомерБлока(ТипыБлоков.ВыборВарианта);
	СледующийНомерЛинии = ПолучитьСледующийНомерБлока(ТипыБлоков.Линия);
	
	Блок = ЭлементыСхемы.Добавить();
	Блок.Тип           = ТипыБлоков.ВыборВарианта;
	Блок.НомерПП       = МаксимальныйНомерЭлемента + 4;
	Блок.Идентификатор = "ВыборВарианта" + СледующийНомерБлока;
	Блок.КоординатаX   = 60;
	Блок.КоординатаY   = 40;
	Блок.РазмерX       = 160;
	Блок.РазмерY       = 120;
	Блок.Заголовок     = "ВыборВарианта" + СледующийНомерБлока;

	Для Сч = 1 По 3 Цикл
		НовыйВариант = Блок.Варианты.Добавить();
		ЗаполнитьЗначенияСвойств(НовыйВариант, Новый Структура("Идентификатор, Заголовок",
			"Вариант" + Сч, "Вариант" + Сч));
		
		КоординатыТочек = Новый СписокЗначений;
		КоординатыТочек.Добавить(220);
		КоординатыТочек.Добавить(96 + Сч * 18);
		КоординатыТочек.Добавить(250);
		КоординатыТочек.Добавить(96 + Сч * 18);
		
		Линия = ЭлементыСхемы.Добавить();
		Линия.Тип                 = ТипыБлоков.Линия;
		Линия.НомерПП             = МаксимальныйНомерЭлемента + Сч;
		Линия.Идентификатор       = "Линия" + (СледующийНомерЛинии + Сч - 1);
		Линия.ВладелецЛинии       = МаксимальныйНомерЭлемента + 4;
		Линия.ТочкаВладельцаЛинии = 5 + Сч * 2;
		Линия.ЦельЛинии           = -1;
		Линия.ТочкаЦелиЛинии      = 2;
		Линия.КоординатыТочек     = КоординатыТочек;
		Линия.ТочкаВарианта       = Сч - 1;
	КонецЦикла;
	
	ГС_СхемаКлиентСервер.УстановитьСхемуИзЭлементов(Схема, СформироватьМассивЭлементов());
	
	УстановитьНомерБлока(ТипыБлоков.ВыборВарианта, СледующийНомерБлока);
	УстановитьНомерБлока(ТипыБлоков.Линия, СледующийНомерЛинии + 2);
	МаксимальныйНомерЭлемента = МаксимальныйНомерЭлемента + 4;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//
//
&НаКлиенте
Функция СформироватьМассивЭлементов()
	
	ТипыБлоков = ГС_СхемаКлиентСервер.ТипыБлоков();
	МассивЭлементов = Новый Массив;
	
	Для каждого СтрокаТаблицыЭлементов Из ЭлементыСхемы Цикл
		Если СтрокаТаблицыЭлементов.Тип = ТипыБлоков.Линия Тогда
			СтруктураЭлемента = ГС_СхемаКлиентСервер.ПолучитьСтруктуруЛинии();
		Иначе
			СтруктураЭлемента = ГС_СхемаКлиентСервер.ПолучитьСтруктуруБлока();
			
			МассивВариантов = Новый Массив;
			Для каждого Вариант Из СтрокаТаблицыЭлементов.Варианты Цикл
				МассивВариантов.Добавить(Новый Структура("Идентификатор, заголовок",
					Вариант.Идентификатор, Вариант.заголовок));
			КонецЦикла;
			СтруктураЭлемента.МассивВариантов = МассивВариантов;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтруктураЭлемента, СтрокаТаблицыЭлементов);
		
		МассивЭлементов.Добавить(СтруктураЭлемента);
	КонецЦикла;
	
	Возврат МассивЭлементов;
	
КонецФункции

//
//
&НаКлиенте
Функция ПолучитьСледующийНомерБлока(Тип)
	
	СтрокиБлока = НомераЭлементовПоТипам.НайтиСтроки(Новый Структура("Тип", Тип));
	Если СтрокиБлока.Количество() = 1 Тогда
		ТекущееКоличество = СтрокиБлока[0].Количество;
	Иначе
		ТекущееКоличество = 0;
	КонецЕсли;
	
	СледующийНомерБлока = ТекущееКоличество + 1;
	
	Возврат СледующийНомерБлока;
	
КонецФункции

//
//
&НаКлиенте
Процедура УстановитьНомерБлока(Тип, НомерБлока)
	
	СтрокиБлока = НомераЭлементовПоТипам.НайтиСтроки(Новый Структура("Тип", Тип));
	Если СтрокиБлока.Количество() = 1 Тогда
		СтрокиБлока[0].Количество = НомерБлока;
	Иначе
		НоваяСтрока = НомераЭлементовПоТипам.Добавить();
		НоваяСтрока.Тип        = Тип;
		НоваяСтрока.Количество = НомерБлока;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
